app/Views/Admin/templates.php

SELECT *
FROM `users`
WHERE `username` = 'admin1'
SELECT *
FROM `menus_access`
WHERE `role_name` = 'Admin'
SELECT *
FROM `menus`
WHERE `id` = '1'
---
            <ul class="metismenu" id="menu">
                <?php
                $this->db = \Config\Database::connect();
                $user = $this->db->table('users')->where('username', $_SESSION['username'])->get()->getRowArray();
                $menusAccess = $this->db->table('menus_access')->where('role_name', $user['role'])->get()->getResultArray();
                if ($user['role'] == 'Kasir') {
                    foreach ($menusAccess as $menu):
                        $menus = $this->db->table('menus')->where('id', $menu['menu_id'])->get()->getRowArray();

SELECT *
FROM `menus`
---
                        </li>
                    <?php endforeach;
                } else {
                    $menu = $this->db->table('menus')->get()->getResultArray();