app/Views/Admin/table/table-menus.php

$this->db = \Config\Database::connect();
$no = 1;
foreach ($menu as $l):
    $menusAccess = $this->db->table('menus_access')->where(['role_name' => 'Kasir', 'menu_id' => $l['id']])->get()->getRowArray();
---
SELECT *
FROM `menus_access`
WHERE `role_name` = 'Kasir'
AND `menu_id` = '1'