app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'admin1'
 LIMIT 1
---
    public function login()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('username', $username)->first();