app/Controllers/MenusController.php

SELECT *
FROM `menus`
---
    public function getMenus()
    {
        $data = [
            'menu' => $this->menusModel->get()->getResultArray(),
        ];

SELECT *
FROM `users`
WHERE `username` = 'admin1'
SELECT *
FROM `menus_access`
WHERE `role_name` = 'Admin'
AND `menu_id` = '1'
INSERT INTO `menus_access` (`role_name`, `menu_id`) VALUES ('Kasir', '1')
---
    public function updateAccess()
    {
        $builder = $this->db->table('menus_access');
        $user = $this->userModel->where('username', $_SESSION['username'])->get()->getRowArray();
        $id = $this->request->getPost('id');
        $menusAccess = $builder->where(['role_name' => $user['role'], 'menu_id' => $id])->get()->getRowArray();
        if (!empty($menusAccess)) {
            $builder->where('id', $menusAccess['id']);
            if ($builder->delete()) {
                return $this->response->setJSON([
                    'status' => 'success',
                    'message' => 'Access Controll Successfully Updated',
                ]);
            }
        } else {
            $data = [
                'role_name' => 'Kasir',
                'menu_id' => $id,
            ];
            if ($builder->insert($data)) {