app/Controllers/UsersController.php

INSERT INTO `users` (`name`, `username`, `password`, `role`, `created_at`, `updated_at`) VALUES ('Kasir Dua', 'kasir2', '$2y$10$b7ME02R/f4cFppiKdqMRDujqTv3AXQCJZqfdMHG.PkXf4Prv.UMRm', 'Kasir', '2025-02-04 15:42:16', '2025-02-04 15:42:16')
---
            'updated_at' => date('Y-m-d H:i:s'),
        ];

        if ($this->userModel->insert($data)) {

SELECT *
FROM `users`
WHERE `role` != 'Admin'
AND `status` = 0
---
    public function getUser()
    {
        $data = [
            'user' => $this->userModel->where('role !=', 'Admin')->where('status', 0)->get()->getResultArray(),
        ];

SELECT *
FROM `users`
WHERE `id` = '3'
---
    public function getFormEdit()
    {
        $data = [
            'user' => $this->userModel->where('id', $_POST['id'])->get()->getRowArray(),
        ];

UPDATE `users` SET `name` = 'Kasir Dua', `updated_at` = '2025-02-10 15:28:23'
WHERE `users`.`id` IN ('3')
---
    public function updateUser()
    {
        $validationRules = [
            'name' => [
                'label' => 'Fullname',
                'rules' => 'required|min_length[3]|max_length[50]',
            ],
        ];

        if (!$this->validate($validationRules)) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => $this->validator->getErrors(),
            ]);
        }
        $data = [
            'name' => $this->request->getPost('name'),
            'updated_at' => date('Y-m-d H:i:s'),
        ];
        $id = $this->request->getPost('id');
        if ($this->userModel->update($id, $data)) {

SELECT *
FROM `users`
WHERE `id` = '3'
---
    public function getFormEditPassword()
    {
        $data = [
            'user' => $this->userModel->where('id', $_POST['id'])->get()->getRowArray(),
        ];