app/Controllers/UsersController.php

    public function getUser()
    {
        $data = [
            'user' => $this->userModel->where('role !=', 'Admin')->get()->getResultArray(),
        ];
---
SELECT *
FROM `users`
WHERE `role` != 'Admin'